Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.CannotCreateCornerMullionDueAngle Property
 Can't create Corner Mullion due to the angle between the neighboring panels. Try changing the Parameters in the Curtain Wall Mullion Family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateCornerMullionDueAngle { get; }
Public Shared ReadOnly Property CannotCreateCornerMullionDueAngle As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateCornerMullionDueAngle {
	FailureDefinitionId^ get ();
}
static member CannotCreateCornerMullionDueAngle : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace